tutorials/AMB2018-01-L7/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam); 

beam
{
    pathName            scan_path_even;    

    absorptionModel     constant;
    
    constantCoeffs
    {
        eta             0.3;
    }
    
    heatSourceModel     superGaussian;
    
    superGaussianCoeffs
    {
        k               2.0;
        dimensions      (85.0e-6 85.0e-6 30e-6);
    }
}

refinementControl
{
    refine                  true;
    nLevels                 2;
    
    refinementTemperature   1e15;//1250;
    
    refinementController    uniformIntervals;
    
    uniformIntervalsCoeffs
    {
        intervals   20;
        //boundingBox (-50e-6 -50e-6 -50e-6) (50e-6 50e-6 0);
    }
}

// ************************************************************************* //
